alistairbill/epsolar/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZED=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# No light sleep, deliberately: on the C6 the 802.15.4 receive path does not
# survive it (the radio goes permanently deaf after the first sleep; run 23
# here, esp-zigbee-sdk #775, IDF-7317). The battery regime is one telemetry
# cycle per deep-sleep wake instead, like Espressif's own battery examples.
